extends Node2D

class_name Component

# Основний клас компонентів. Компоненти функціонують як ноди, створені розробниками гри. По суті
# компоненти являються нодами типу Node2D до яких прив'язано скрипт. Компоненти можна додати до певних
# сцен, як наприклад сцена гравця або ворога, аби розширити їхній функціонал.

@export var component_name: String ## Назва комопонента
## Менеджер статів. Відповідає за модифікації та зберігання статів компонента
@export var stat_manager: StatManager 
@export var StMachine: StateMachine
